*Abbiamo importato le librerie*

In [1]:
import pandas as pd
import re
import numpy as np

*Facciamo read csv di tutti i dataframe*

In [2]:
timesData = pd.read_csv("dataframe/timesData.csv")
timesData.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [3]:
shanghaiData = pd.read_csv("dataframe/shanghaiData.csv")
shanghaiData.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [4]:
school_and_country = pd.read_csv("dataframe/school_and_country_table.csv")
school_and_country.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

In [5]:
cwurData = pd.read_csv("dataframe/cwurData.csv")
cwurData.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [6]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [7]:
education_expenditure = pd.read_csv("dataframe/education_expenditure_supplementary_data.csv",engine='python')
education_expenditure.head()

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
0,OECD Average,All Institutions,Public,4.9,4.9,5.0,5.4,5.4,5.3
1,Australia,All Institutions,Public,4.5,4.6,4.3,4.5,4.6,4.3
2,Austria,All Institutions,Public,5.3,5.4,5.2,5.7,5.6,5.5
3,Belgium,All Institutions,Public,5.0,5.1,5.8,6.4,6.4,6.4
4,Canada,All Institutions,Public,5.8,5.2,4.8,5.0,5.2,NaN

In [8]:
timesData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2603 non-null   object
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2603 non-null   object
 8   total_score             2603 non-null   object
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2370 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(4), int64(1), object(9)
memory usage: 284.8+ KB

In [10]:
timesData['income']=pd.to_numeric(timesData['income'], errors='coerce') #da object me lo trasforma in float64

### 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframe

*A partire dal dataframe 'Times', raggruppiamo per 'university_name', estraiamo l'anno e prendiamo il massimo ovvero quello più recente*

In [14]:
most_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmax())]
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

*A partire dal dataframe 'Times', raggruppiamo per 'university_name', estraiamo l'anno e prendiamo il minimo ovvero quello meno recente*

In [16]:
least_recent_data=timesData.loc[(timesData.groupby('university_name')['year'].idxmin())]
least_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

### 2. For each university, compute the improvement in "income" between the least recent and the most recent data points

*Facciamo il merge delle 2 tabelle precedentemente ottenute usando 'university_name'*

In [17]:
punto2=pd.merge(most_recent_data, least_recent_data, on='university_name')
punto2.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,international_y,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

In [18]:
punto2.columns

Index(['world_rank_x', 'university_name', 'country_x', 'teaching_x',
       'international_x', 'research_x', 'citations_x', 'income_x',
       'total_score_x', 'num_students_x', 'student_staff_ratio_x',
       'international_students_x', 'female_male_ratio_x', 'year_x',
       'world_rank_y', 'country_y', 'teaching_y', 'international_y',
       'research_y', 'citations_y', 'income_y', 'total_score_y',
       'num_students_y', 'student_staff_ratio_y', 'international_students_y',
       'female_male_ratio_y', 'year_y'],
      dtype='object')

*Rinominato le colonne di interesse*

In [19]:
punto2=punto2.rename(columns={'income_x':'income_most_recent','income_y':'income_least_recent'})
punto2.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_most_recent,total_score_x,num_students_x,...,international_y,research_y,citations_y,income_least_recent,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

*Calcolo dell'income improvement*

In [20]:
punto2['income_improvement']=punto2['income_most_recent']-punto2['income_least_recent']
punto2.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_most_recent,total_score_x,num_students_x,...,research_y,citations_y,income_least_recent,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y,income_improvement
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016,NaN
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012,7.3
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012,-0.3
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011,6.8
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012,-4.2

### 3. Find the university with the largest increase computed in the previous point

*Prendiamo l'università con income improvement più elevato*

In [22]:
punto2.loc[punto2['income_improvement']>= punto2['income_improvement'].max()]['university_name'] #possiamo anche togliere l'ultima quadra

428    TU Dresden
Name: university_name, dtype: object

### 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

In [23]:
most_recent_s=shanghaiData.loc[(shanghaiData.groupby('university_name')['year'].idxmax())]
most_recent_c=cwurData.loc[(cwurData.groupby('institution')['year'].idxmax())]
#most_recent_data

In [24]:
most_recent_data['world_rank']

2405    601-800
2003    201-250
2056    251-300
1908       =106
2105    301-350
         ...
1856         54
2013    201-250
1904       =101
1833         31
2134    301-350
Name: world_rank, Length: 818, dtype: object

In [25]:
lista = most_recent_data['world_rank']
df =pd.DataFrame(lista)
df.head()

     world_rank
2405    601-800
2003    201-250
2056    251-300
1908       =106
2105    301-350

In [26]:
df['min_range'] = df['world_rank'].str.extract(r'^\=?(\d+)')
df['max_range'] = df['world_rank'].str.extract(r'(\d+$)')
df.head()

     world_rank min_range max_range
2405    601-800       601       800
2003    201-250       201       250
2056    251-300       251       300
1908       =106       106       106
2105    301-350       301       350

In [27]:
df['min_range']=pd.to_numeric(df['min_range'], errors='coerce')
df['max_range']=pd.to_numeric(df['max_range'], errors='coerce')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   world_rank  818 non-null    object
 1   min_range   818 non-null    int64
 2   max_range   818 non-null    int64
dtypes: int64(2), object(1)
memory usage: 25.6+ KB

In [28]:
most_recent_data['world_rank_t'] = (df['max_range'] + df['min_range'])//2
most_recent_data['world_rank_t'].head()

2405    700
2003    225
2056    275
1908    106
2105    325
Name: world_rank_t, dtype: int64

In [29]:
#rifacciamo per s
lista_s = most_recent_s['world_rank']
df_s =pd.DataFrame(lista_s)
df_s['min_range'] = df_s['world_rank'].str.extract(r'^\=?(\d+)')
df_s['max_range'] = df_s['world_rank'].str.extract(r'(\d+$)')
df_s['min_range']=pd.to_numeric(df_s['min_range'], errors='coerce')
df_s['max_range']=pd.to_numeric(df_s['max_range'], errors='coerce')
most_recent_s['world_rank_s'] = (df_s['max_range'] + df_s['min_range'])//2
most_recent_s.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_s
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,350
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015,450
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,73
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015,125
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011,126

In [30]:
most_recent_c.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1024 entries, 1981 to 1838
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            1024 non-null   int64
 1   institution           1024 non-null   object
 2   country               1024 non-null   object
 3   national_rank         1024 non-null   int64
 4   quality_of_education  1024 non-null   int64
 5   alumni_employment     1024 non-null   int64
 6   quality_of_faculty    1024 non-null   int64
 7   publications          1024 non-null   int64
 8   influence             1024 non-null   int64
 9   citations             1024 non-null   int64
 10  broad_impact          1023 non-null   float64
 11  patents               1024 non-null   int64
 12  score                 1024 non-null   float64
 13  year                  1024 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 120.0+ KB

In [31]:
most_recent = pd.merge(most_recent_data, most_recent_s, on='university_name', how='left' )
most_recent

,world_rank_x,university_name,country,teaching,international,research,citations,income,total_score_x,num_students,...,national_rank,total_score_y,alumni,award,hici,ns,pub,pcp,year_y,world_rank_s
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015.0,350.0
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015.0,450.0
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015.0,73.0
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
813,54,École Normale Supérieure,France,70.6,85.5,47.7,87.1,37.1,69.0,"2,400",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
814,201-250,École Normale Supérieure de Lyon,France,41.6,65.6,30.0,69.0,31.7,-,"2,218",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
815,=101,École Polytechnique,France,53.5,92.8,44.6,64.7,82.3,57.9,"2,429",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
816,31,École Polytechnique Fédérale de Lausanne,Switzerland,61.3,98.6,67.5,94.6,65.4,76.1,"9,666",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
817,301-350,Örebro University,Sweden,18.3,39.4,10.4,87.8,29.8,-,"8,788",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [32]:
most_recent1 = pd.merge(most_recent, most_recent_c, left_on= 'university_name', right_on = 'institution', how='left')
most_recent1

,world_rank_x,university_name,country_x,teaching,international,research,citations_x,income,total_score_x,num_students,...,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations_y,broad_impact,patents,score,year
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",...,267.0,279.0,218.0,708.0,891.0,511.0,896.0,398.0,44.26,2015.0
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",...,367.0,439.0,218.0,596.0,660.0,287.0,520.0,401.0,44.59,2015.0
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",...,367.0,224.0,218.0,336.0,403.0,645.0,424.0,246.0,45.10,2015.0
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,310.0,165.0,106.0,91.0,81.0,101.0,95.0,154.0,49.65,2015.0
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",...,367.0,567.0,218.0,842.0,552.0,511.0,754.0,607.0,44.22,2015.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
813,54,École Normale Supérieure,France,70.6,85.5,47.7,87.1,37.1,69.0,"2,400",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
814,201-250,École Normale Supérieure de Lyon,France,41.6,65.6,30.0,69.0,31.7,-,"2,218",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
815,=101,École Polytechnique,France,53.5,92.8,44.6,64.7,82.3,57.9,"2,429",...,98.0,7.0,216.0,327.0,314.0,234.0,295.0,172.0,59.20,2015.0
816,31,École Polytechnique Fédérale de Lausanne,Switzerland,61.3,98.6,67.5,94.6,65.4,76.1,"9,666",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
817,301-350,Örebro University,Sweden,18.3,39.4,10.4,87.8,29.8,-,"8,788",...,367.0,529.0,218.0,816.0,747.0,428.0,549.0,871.0,44.44,2015.0

In [33]:
most_recent1.columns

Index(['world_rank_x', 'university_name', 'country_x', 'teaching',
       'international', 'research', 'citations_x', 'income', 'total_score_x',
       'num_students', 'student_staff_ratio', 'international_students',
       'female_male_ratio', 'year_x', 'world_rank_t', 'world_rank_y',
       'national_rank_x', 'total_score_y', 'alumni', 'award', 'hici', 'ns',
       'pub', 'pcp', 'year_y', 'world_rank_s', 'world_rank', 'institution',
       'country_y', 'national_rank_y', 'quality_of_education',
       'alumni_employment', 'quality_of_faculty', 'publications', 'influence',
       'citations_y', 'broad_impact', 'patents', 'score', 'year'],
      dtype='object')

In [35]:
most_recent1['HighScore'] = most_recent1[['world_rank_t','world_rank','world_rank_s']].max(axis = 1)
most_recent1['LowScore'] = most_recent1[['world_rank_t','world_rank','world_rank_s']].min(axis = 1)
most_recent1['maximum_difference'] = most_recent1['HighScore']-most_recent1['LowScore']
most_recent1[['university_name','maximum_difference','HighScore','LowScore','world_rank_t','world_rank','world_rank_s']]

,university_name,maximum_difference,HighScore,LowScore,world_rank_t,world_rank,world_rank_s
0,AGH University of Science and Technology,82.0,782.0,700.0,700,782.0,NaN
1,Aalborg University,340.0,565.0,225.0,225,565.0,350.0
2,Aalto University,175.0,450.0,275.0,275,421.0,450.0
3,Aarhus University,49.0,122.0,73.0,106,122.0,73.0
4,Aberystwyth University,489.0,814.0,325.0,325,814.0,NaN
...,...,...,...,...,...,...,...
813,École Normale Supérieure,0.0,54.0,54.0,54,NaN,NaN
814,École Normale Supérieure de Lyon,0.0,225.0,225.0,225,NaN,NaN
815,École Polytechnique,65.0,101.0,36.0,101,36.0,NaN
816,École Polytechnique Fédérale de Lausanne,0.0,31.0,31.0,31,NaN,NaN
817,Örebro University,314.0,639.0,325.0,325,639.0,NaN

### 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

In [36]:
most_recent_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              818 non-null    object
 1   university_name         818 non-null    object
 2   country                 818 non-null    object
 3   teaching                818 non-null    float64
 4   international           818 non-null    object
 5   research                818 non-null    float64
 6   citations               818 non-null    float64
 7   income                  774 non-null    float64
 8   total_score             818 non-null    object
 9   num_students            796 non-null    object
 10  student_staff_ratio     796 non-null    float64
 11  international_students  793 non-null    object
 12  female_male_ratio       742 non-null    object
 13  year                    818 non-null    int64
 14  world_rank_t            818 non-null    int64
dtypes: float64(5), int64(2), object(8)
memory usage: 102.2+ KB

*Estraiamo le proporzioni per female e male*

In [37]:
most_recent_data['female'] = most_recent_data['female_male_ratio'].str.extract(r'(^\d+)')
most_recent_data['male'] = most_recent_data['female_male_ratio'].str.extract(r'(\d+$)')
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t,female,male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,"35,569",17.0,1%,-,2016,700,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,225,48,52
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,275,32,68
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106,54,46
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,325,48,52

In [38]:
most_recent_data.info() #notiamo che female e male sono di tipo 'object'

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 17 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              818 non-null    object
 1   university_name         818 non-null    object
 2   country                 818 non-null    object
 3   teaching                818 non-null    float64
 4   international           818 non-null    object
 5   research                818 non-null    float64
 6   citations               818 non-null    float64
 7   income                  774 non-null    float64
 8   total_score             818 non-null    object
 9   num_students            796 non-null    object
 10  student_staff_ratio     796 non-null    float64
 11  international_students  793 non-null    object
 12  female_male_ratio       742 non-null    object
 13  year                    818 non-null    int64
 14  world_rank_t            818 non-null    int64
 15  female                  739 non-null    object
 16  male                    739 non-null    object
dtypes: float64(5), int64(2), object(10)
memory usage: 115.0+ KB

In [39]:
most_recent_data['male']=pd.to_numeric(most_recent_data['male'], errors='coerce')
most_recent_data['female']=pd.to_numeric(most_recent_data['female'], errors='coerce')

In [40]:
most_recent_data.info() #ora notiamo che female e male sono di tipo 'float64' (anche num_students che verrà castato di seguito)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 17 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              818 non-null    object
 1   university_name         818 non-null    object
 2   country                 818 non-null    object
 3   teaching                818 non-null    float64
 4   international           818 non-null    object
 5   research                818 non-null    float64
 6   citations               818 non-null    float64
 7   income                  774 non-null    float64
 8   total_score             818 non-null    object
 9   num_students            796 non-null    object
 10  student_staff_ratio     796 non-null    float64
 11  international_students  793 non-null    object
 12  female_male_ratio       742 non-null    object
 13  year                    818 non-null    int64
 14  world_rank_t            818 non-null    int64
 15  female                  739 non-null    float64
 16  male                    739 non-null    float64
dtypes: float64(7), int64(2), object(8)
memory usage: 115.0+ KB

*Abbiamo tolto la virgola delle migliaia*

In [41]:
most_recent_data['num_students'] = most_recent_data['num_students'].str.replace(',','')
most_recent_data['num_students']=pd.to_numeric(most_recent_data['num_students'], errors='coerce')
most_recent_data.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t,female,male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,-,35569.0,17.0,1%,-,2016,700,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,15.9,15%,48 : 52,2016,225,48.0,52.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,275,32.0,68.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016,106,54.0,46.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,19.2,18%,48 : 52,2016,325,48.0,52.0

In [45]:
most_recent_data['num_male']= most_recent_data['male'] * most_recent_data['num_students'] // 100
most_recent_data['num_fem']= most_recent_data['female'] * most_recent_data['num_students'] // 100
most_recent_data.groupby('country')['num_fem'].sum()

country
Argentina                      67191.0
Australia                     391722.0
Austria                        68362.0
Bangladesh                     21323.0
Belarus                        20219.0
                               ...
Unisted States of America          0.0
United Arab Emirates            9515.0
United Kingdom                711775.0
United States of America     1601393.0
Unted Kingdom                      0.0
Name: num_fem, Length: 72, dtype: float64

In [47]:
most_recent_data.groupby('country')['num_male'].sum()

country
Argentina                      41181.0
Australia                     321624.0
Austria                        66109.0
Bangladesh                     41392.0
Belarus                         9083.0
                               ...
Unisted States of America          0.0
United Arab Emirates            4930.0
United Kingdom                612993.0
United States of America     1556253.0
Unted Kingdom                      0.0
Name: num_male, Length: 72, dtype: float64

### 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

*Calcoliamo rapporto e successivamente la media*

In [50]:
most_recent_data['rapporto'] = most_recent_data['num_fem'] / most_recent_data['num_male']
media = most_recent_data['rapporto'].notnull().mean() #notnull perchè ci sono i nan
print(media)

0.9034229828850856

*Confrontiamo e prendiamo quelli con rapporto minore della media*

In [53]:
punto6 = most_recent_data.loc[most_recent_data['rapporto'] <= media]
punto6.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t,female,male,num_male,num_fem,rapporto
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,24.2,17%,32 : 68,2016,275,32.0,68.0,10947.0,5151.0,0.470540
2406,601-800,Ajou University,South Korea,19.5,20.0,11.9,23.9,45.7,-,12706.0,11.3,2%,33 : 67,2016,700,33.0,67.0,8513.0,4192.0,0.492423
2408,601-800,Alexandria University,Egypt,20.3,33.7,8.2,14.1,29.7,-,127431.0,23.3,1%,46 : 54,2016,700,46.0,54.0,68812.0,58618.0,0.851857
2410,601-800,Aligarh Muslim University,India,28.3,18.7,10.0,20.9,29.6,-,11197.0,10.5,2%,17 : 83,2016,700,17.0,83.0,9293.0,1903.0,0.204778
2304,501-600,Amirkabir University of Technology,Iran,24.5,7.7,25.7,34.8,55.7,-,14080.0,25.6,1%,34 : 66,2016,550,34.0,66.0,9292.0,4787.0,0.515174

*Estraiamo solo i nomi delle università che soddisfano il punto 6*

In [54]:
punto6['university_name']

2056                            Aalto University
2406                             Ajou University
2408                       Alexandria University
2410                   Aligarh Muslim University
2304          Amirkabir University of Technology
                          ...
2599                 Yıldız Technical University
2104                         Zhejiang University
1856                    École Normale Supérieure
1904                         École Polytechnique
1833    École Polytechnique Fédérale de Lausanne
Name: university_name, Length: 237, dtype: object

### 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

*Calcolo del denominatore sommando tutti i num_students di ciascun Paese*

In [58]:
denominatore = most_recent_data.groupby('country', as_index = True)['num_students'].sum()
denominatore

country
Argentina                     108373.0
Australia                     743627.0
Austria                       134477.0
Bangladesh                     62716.0
Belarus                        29303.0
                               ...
Unisted States of America          0.0
United Arab Emirates           14447.0
United Kingdom               1324842.0
United States of America     3280303.0
Unted Kingdom                      0.0
Name: num_students, Length: 72, dtype: float64

*Per il numeratore sommando tutti i num_students dei Paesi le cui relative università sono presento nel punto 6*

In [59]:
numeratore=punto6.groupby('country')['num_students'].sum()
numeratore

country
Australia                    88124.0
Austria                      33961.0
Bangladesh                   62716.0
Brazil                       76359.0
Canada                       55762.0
Chile                        90951.0
China                       681095.0
Colombia                     15773.0
Czech Republic               23694.0
Denmark                       9990.0
Egypt                       359372.0
Estonia                      14061.0
Finland                      25732.0
France                       31848.0
Germany                     280201.0
Ghana                        37274.0
Greece                       57198.0
Hungary                      22447.0
India                       122803.0
Iran                        107280.0
Israel                       13855.0
Italy                        75554.0
Japan                       444543.0
Kenya                        72676.0
Malaysia                     16270.0
Mexico                       14353.0
Morocco                      56060.0
Netherlands                  30727.0
Nigeria                      26247.0
Norway                       17381.0
Pakistan                      9808.0
Poland                       59789.0
Portugal                     11778.0
Republic of Ireland          26051.0
Russian Federation           90929.0
Slovakia                     16400.0
South Korea                 229171.0
Spain                       113295.0
Sweden                       20667.0
Switzerland                  34692.0
Taiwan                      205453.0
Thailand                     53408.0
Turkey                      204511.0
Ukraine                      22686.0
United Kingdom              144053.0
United States of America    662221.0
Name: num_students, dtype: float64

*Controllo che effettiviamente siano dei float64*

In [60]:
numeratore.dtype

dtype('float64')

In [62]:
denominatore.dtype

dtype('float64')

In [63]:
fraction=numeratore/denominatore
fraction.head

<bound method NDFrame.head of country
Argentina                         NaN
Australia                    0.118506
Austria                      0.252541
Bangladesh                   1.000000
Belarus                           NaN
                               ...
Unisted States of America         NaN
United Arab Emirates              NaN
United Kingdom               0.108732
United States of America     0.201878
Unted Kingdom                     NaN
Name: num_students, Length: 72, dtype: float64>

In [ ]:
#most_recent_data.loc[most_recent_data.groupby('country').sum()['num_students']]

### 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [64]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [68]:
educ = educational_attainment[(educational_attainment['country_name'].notnull()) & (educational_attainment['series_name'].notnull())]
educ.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

### 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

*Eliminare tutte le colonne con tutti valori nulli se ci fosse stato any avrebbe eliminato solo le colonne con almeno un valore nullo*

In [69]:
ed_pulito= educ.dropna(axis='columns', how='all')
ed_pulito.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,NaN,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,NaN,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,NaN,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,NaN,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,NaN,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN

In [70]:
pd.melt?

In [71]:
ed_pulito.columns[2:] #necessario per capire gli anni presenti nel dataframe

Index(['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013'],
      dtype='object')

In [73]:
pd.melt(ed_pulito, id_vars=['country_name','series_name'], value_vars=['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006',
       '2007', '2008', '2009', '2010', '2011', '2012', '2013'])

,country_name,series_name,variable,value
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.33
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,1.03
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.83
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,2.34
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.54
...,...,...,...,...
1976245,Zimbabwe,UIS: Percentage of population age 25+ with som...,2013,NaN
1976246,Zimbabwe,UIS: Percentage of population age 25+ with som...,2013,NaN
1976247,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2013,NaN
1976248,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2013,NaN
1976249,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2013,NaN

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

*Facciamo il merge di times cwur e shanghai e prendiamo solo le colonne di interesse*

In [74]:
#facciamo il merge di times cwur e shanghai e prendiamo solo le colonne di interesse
tabella_merge=pd.merge(timesData,cwurData,how='left', left_on='university_name', right_on='institution')
tabella_merge=pd.merge(tabella_merge,shanghaiData,how='left', on='university_name')
tabella_merge=tabella_merge.rename(columns={'world_rank':'world_rank_times','world_rank_x':'world_rank_cwur','world_rank_y':'world_rank_shanghai' })
tabella_merge=tabella_merge[['university_name','world_rank_times','world_rank_cwur','world_rank_shanghai']]
#rinominiamo
tabella_merge['world_rank_shanghai']=tabella_merge['world_rank_shanghai'].replace(np.nan, 'Dato mancante')
tabella_merge['world_rank_times']=tabella_merge['world_rank_times'].replace(np.nan, 'Dato mancante')
tabella_merge['world_rank_cwur']=tabella_merge['world_rank_cwur'].replace(np.nan, 'Dato mancante')

In [75]:
#definizione della funzione counter che mi conta quante volte il dato non è mancante
def counter(col1,col2,col3):
    count=0
    if (col1!='Dato mancante'):
        count+=1
    if (col2!='Dato mancante'):
        count+=1
    if (col3!='Dato mancante'):
        count+=1

    return count

In [79]:
#applicchiamo counter
tabella_merge['counter']=tabella_merge.apply(lambda x:counter(x.world_rank_times,x.world_rank_cwur,x.world_rank_shanghai), axis=1)
tabella_merge.head()

,university_name,world_rank_times,world_rank_cwur,world_rank_shanghai,counter
0,Harvard University,1,1,1,3
1,Harvard University,1,1,1,3
2,Harvard University,1,1,1,3
3,Harvard University,1,1,1,3
4,Harvard University,1,1,1,3

### 11. In the times ranking, compute the number of times each university appears

*Raggruppiamo per university_name, estraiamo world_rank e contiamo*

In [81]:
punto11 = timesData.groupby('university_name', as_index = False)['world_rank'].count()
punto11

                              university_name  world_rank
0    AGH University of Science and Technology           1
1                          Aalborg University           5
2                            Aalto University           5
3                           Aarhus University           6
4                      Aberystwyth University           5
..                                        ...         ...
813                  École Normale Supérieure           6
814          École Normale Supérieure de Lyon           6
815                       École Polytechnique           6
816  École Polytechnique Fédérale de Lausanne           6
817                         Örebro University           1

[818 rows x 2 columns]

### 12. Find the universities that appear at most twice in the times ranking.

In [82]:
punto12 = punto11[punto11['world_rank']<= 2]
punto12

                              university_name  world_rank
0    AGH University of Science and Technology           1
5                  Adam Mickiewicz University           1
6                    Aix-Marseille University           1
7                             Ajou University           1
9              Alexandru Ioan Cuza University           1
..                                        ...         ...
806                  Yokohama City University           1
807              Yokohama National University           1
810                        Yuan Ze University           2
811               Yıldız Technical University           1
817                         Örebro University           1

[408 rows x 2 columns]

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

*Facciamo il merge dei 3 dataframes*

In [83]:
punto13 = pd.merge(timesData, cwurData, left_on=['university_name','year'], right_on = ['institution','year'])
punto13= pd.merge(punto13, shanghaiData, on= ['university_name', 'year'])
punto13= punto13.rename(columns= {'world_rank_x':'world_rank_times','world_rank_y': 'world_rank_cwur','world_rank' : 'world_rank_shanghai'})

*Estraiamo le colonne di interesse*

In [84]:
punto13= punto13[['university_name','year','world_rank_times','world_rank_cwur','world_rank_shanghai']]
punto13.head()

,university_name,year,world_rank_times,world_rank_cwur,world_rank_shanghai
0,California Institute of Technology,2012,1,5,6
1,Harvard University,2012,2,1,1
2,Stanford University,2012,2,3,2
3,University of Oxford,2012,4,7,10
4,Princeton University,2012,5,6,7

In [85]:
punto13.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 551 entries, 0 to 550
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   university_name      551 non-null    object
 1   year                 551 non-null    int64
 2   world_rank_times     551 non-null    object
 3   world_rank_cwur      551 non-null    int64
 4   world_rank_shanghai  551 non-null    object
dtypes: int64(2), object(3)
memory usage: 25.8+ KB

*Prendiamo solo le università per cui il world rank in Times è uguale al world rank in Shanghai*

In [86]:
punto13 = punto13.loc[(punto13['world_rank_times'] == punto13['world_rank_shanghai'])]
punto13

,university_name,year,world_rank_times,world_rank_cwur,world_rank_shanghai
2,Stanford University,2012,2,3,2
6,University of Chicago,2012,9,11,9
8,Yale University,2012,11,8,11
60,Stanford University,2013,2,2,2
67,Yale University,2013,11,10,11
70,University of Pennsylvania,2013,15,12,15
79,"University of California, Santa Barbara",2013,35,37,35
109,Princeton University,2014,6,9,6
111,University of Chicago,2014,9,8,9
112,Yale University,2014,11,10,11
113,"University of California, Los Angeles",2014,12,15,12
115,University of Pennsylvania,2014,16,14,16
331,University of Cambridge,2015,5,4,5
336,"University of California, Los Angeles",2015,12,15,12

*Controlliamo se world rank in Times è uguale a wolrd rank in Cwur*

In [87]:
punto13['world_rank_times']=pd.to_numeric(punto13['world_rank_times'], errors='coerce')
punto13['world_rank_shanghai']=pd.to_numeric(punto13['world_rank_shanghai'], errors='coerce')
punto13.loc[(punto13['world_rank_times'] == punto13['world_rank_cwur'])]

,university_name,year,world_rank_times,world_rank_cwur,world_rank_shanghai
60,Stanford University,2013,2,2,2